from dataclasses import dataclass


@dataclass
class Anchor:
    """
    Rocksmith Anchor Model

    左手ポジション情報
    """


    # ==========================================
    # Position
    # ==========================================

    time: float = 0.0


    # ==========================================
    # Fret Position
    # ==========================================

    fret: int = 0


    # ==========================================
    # Hand Span
    # ==========================================

    width: int = 4


    # ==========================================
    # Difficulty
    # ==========================================

    difficulty: int = 0


    # ==========================================
    # Helpers
    # ==========================================

    @property
    def end_fret(self) -> int:

        return (
            self.fret
            + self.width
        )